app/Models/ModelBarangKeluar.php

SELECT max(faktur) as nofaktur
FROM `barangkeluar`
WHERE `tglfaktur` = '2023-09-05'
---
    public function noFaktur($tanggalSekarang)
    {
        return $this->table('barangkeluar')->select('max(faktur) as nofaktur')->where('tglfaktur',
        $tanggalSekarang)->get();